Autodesk.Revit.DB.RuledSurface.GetSecondProfilePoint
If a point was used to define the second profile, returns a copy of that point.
Returns:
The second profile point if it was set.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This surface element does not use a point to define the second profile.
Since:
2017

Autodesk.Revit.DB.RuledSurface.HasSecondProfilePoint
Checks if a point was used to define the second profile.
Returns:
True if a point was used to define the second profile, false otherwise.
Since:
2018

Autodesk.Revit.DB.RuledSurface.GetSecondProfileCurve
Returns a copy of the second profile curve if it is set.
Returns:
A copy of the second profile curve, if it exists. If a point was used to define the second profile, this function will return null.
Since:
2017

Autodesk.Revit.DB.RuledSurface.GetFirstProfilePoint
If a point was used to define the first profile, returns a copy of that point.
Returns:
The first profile point if it was set.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This surface element does not use a point to define the first profile.
Since:
2017

Autodesk.Revit.DB.RuledSurface.HasFirstProfilePoint
Checks if a point was used to define the first profile.
Returns:
True if a point was used to define the first profile, false otherwise.
Since:
2018

Autodesk.Revit.DB.RuledSurface.GetFirstProfileCurve
Returns a copy of the first profile curve if it is set.
Returns:
A copy of the first profile curve, if it exists. If a point was used to define the first profile, this function will return null.
Since:
2017

Autodesk.Revit.DB.RuledSurface.Create(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.XYZ)
Creates a Surface object coincident with the ruled surface joining a bounded generating curve to a point.
Remarks:
The returned surface may not be of type RuledSurf - this function will create a surface of the simplest possible
type (Plane, CylindricalSurface, etc.) that can be used to represent the given ruled surface.
Given that the surface may be simplified, this function does not guarantee any particular parameterization of the surface.
profileCurve:
The profile curve; must be bounded and non-degenerate.
point:
The point.  Expected to lie within the Revit design limits Autodesk.Revit.DB.XYZ.IsWithinLengthLimits(Autodesk.Revit.DB.XYZ).
Returns:
The created surface. Note that this surface may not be of type RuledSurf.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profileCurve is not bound.
-or-
The profileCurve is degenerate (its length is too close to zero).
-or-
The input point lies outside of Revit design limits.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.RuledSurface.Create(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.Curve)
Creates a Surface object coincident with the ruled surface joining two bounded generating curves.
Remarks:
The returned surface may not be of type RuledSurf - this function will create a surface of the simplest possible
type (Plane, CylindricalSurface, etc.) that can be used to represent the given ruled surface.
Given that the surface may be simplified, this function does not guarantee any particular parameterization of the surface.
The curves should be such that a ruled surface whose rulings connect points on the two curves with the same
normalized coordinates has no self-intersections or interior singularities.
profileCurve1:
The first profile curve; must be bounded and non-degenerate.
profileCurve2:
The second profile curve; must be bounded and non-degenerate.
Returns:
The created surface. Note that this surface may not be of type RuledSurf.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profileCurve1 is not bound.
-or-
The profileCurve1 is degenerate (its length is too close to zero).
-or-
The input profileCurve2 is not bound.
-or-
The profileCurve2 is degenerate (its length is too close to zero).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.RuledSurface
A ruled surface is created by sweeping a line between two profile curves or between a curve and a point (a point and a curve).
Input curve(s) must be bounded or have natural bounds.
Remarks:
Both curves are evaluated in normalized parameters [0, 1]
The parametric equations of a ruled surface are:
C1 != 0 and C2 != 0 :   S(u, v) = C1(u) + v * (C2(u) - C1(u));  C2 == 0 and C1 != 0 :   S(u, v) = P1 + v * (C2(u) - P1);  C1 == 0 and C2 != 0 :   S(u, v) = C1(u) + v * (P2 - C1(u));
C1 == 0 and C2 == 0 - is not allowed as that would define a degenerate ruled surface.
Since:
2017